#+setupfile: ~/org/config/setupfile.org
#+options: *:t <:t H:5 num:t TeX:t LaTeX:t author:t toc:t
#+latex_header: \usepackage{cancel}
#+latex_header: \setlist{topsep=0pt}
#+property: header-args:R :tangle yes :comments org

#+title: Analysis of the Dr. Douglas G. Frank voter fraud theory
#+subtitle: \Large \textit{Phantom ballots and the case of the polynomial credit line}
#+author: John Henderson (jw.hendy [at] gmail)
#+date: \vspace{-0.6cm} Compiled with @@latex:\LaTeX@@ via =Org-mode=

#+begin_export latex
\makeatletter
\newcommand*{\compress}{\@minipagetrue}
\makeatother
\newpage
#+end_export

** A note on turnout

On the subject of turnout, there's something curious about Dr. Frank's values. Antrim
County is listed as 61.8%. Where is this from? Antrim County total votes are listed on the
Michigan State website as 16,044 with a registered voter count of 22,082 for a turnout
value of 72.66%.[fn:21] Here are all values used by Dr. Frank vs. the reported turnout among the
nine counties analyzed:[fn:12] 

#+attr_latex: :align l|lll|l|ll
|                | *Dr. Frank* |           |            | *Official* | *Computed* |          |
| *County*       | registered  | 18+ pop   | turnout, % | turnout    |   % of reg | % of pop |
|----------------+-------------+-----------+------------+------------+------------+----------|
| Amtrim         | 24,118      | 19,222    |       61.8 | 16,044     |       66.5 |     83.5 |
| Barry          | 48,628      | 48,094    |       71.8 | 36,146     |       74.3 |     75.2 |
| Charlevoix     | 23,279      | 21,337    |       72.8 | 17,103     |       73.5 |     80.2 |
| Grand Traverse | 79,537      | 74,536    |       72.8 | 60,668     |       76.3 |     81.4 |
| Kent           | 489,234     | 500,078   |       71.3 | 363,695    |       74.3 |     72.7 |
| Livingston     | 157,667     | 152,390   |       78.4 | 127,839    |       81.1 |     83.9 |
| Macomb         | 670,592     | 694,196   |       71.2 | 497,098    |       74.1 |     71.6 |
| Oakland        | 1,011,669   | 999,630   |       74.2 | 775,379    |       76.6 |     77.6 |
| Wayne          | 1,365,392   | 1,339,405 |       61.6 | 878,102    |       64.3 |     65.6 |
#+TBLFM: $6=100*$-1/$2; %0.1f::$7=100*$-2/$3; %0.1f

I believe the turnout value used by Dr. Frank to be the calculated value required
to scale /registered voters/ to predicted votes using the key. Because the key is fixed
per state while the registered voters vs. population surplus varies widely across the counties,
a subsequent scaling factor is required to account for this. 

In practice, voter turnout is reported as a % of either Voting Aged Population
(VAP, all individuals 18+ yrs old) or Voting Eligible Population (VEP, 18+ minus those inelliglble
to vote). For example, the reported figure of 66.7% for the 2020 election is /not/ the percent
of registered voters, but the % of estimated VEP.[fn:22]

Now, Dr. Frank certainly /could/ have used the population as the input for the prediction,
which would have enabled using the more standard values for calculated turnout. Why didn't he?
Well, predicting votes from population entails multiplying his key (smooth) by turnout (a
fixed number) by his population curve (smooth), which would yield a /smooth result/. This
lacks the shock value of strikingly similar shapes between the input and the result. The
matching shape of the registered voters, predicted votes, and votes is what enables this
mathematical optical illusion to work.

\newpage

Here I use the data extracted from Dr. Frank's Antrim County plot to create a 6th
degree polymial key for the vote predicting model: =population * VAP_turnout * key=.

#+begin_src R :session r :exports code :results silent :eval no
df_key <- df %>%
  filter(CTYNAME=="Antrim County") %>%
  pivot_wider(id_cols=c(CTYNAME, age_i),
              names_from=var, values_from=val_i) %>%
  select(CTYNAME, age_i, pop, pred, vote)

fit <- lm(vote ~ poly(pop * 0.835, 6), data=df_key)
df_key <- df_key %>% add_column(pred2 = predict(fit, df_key))
#+end_src

What does this prediction look like?

#+name: pred-pop
#+header: :file ./plots/antrim-pred-pop.pdf :width 9 :height 5
#+begin_src R :session r :exports results :results file graphics :eval no
df_key %>%
  pivot_longer(cols=!c(CTYNAME, age_i)) %>%
  filter(name != "pred") %>%
  ggplot(aes(x=age_i, y=value, color=name)) + geom_line() +
  scale_y_continuous("count") +
  scale_color_manual("",
                     breaks=c("pop", "pred2", "vote"),
                     labels=c("Dr. Frank pop", "Pop key model",
                              "Votes"),
                     values=c("blue", "green3", "red")) +
  theme_bw()
#+end_src

#+attr_latex: :width 0.85\textwidth
#+RESULTS: pred-pop
[[file:./plots/antrim-pred-pop.pdf]]

Comapred to the original Antrim County R-value of 0.993, how does this smooth prediction fare?

#+begin_src R :session r :exports results :results output :eval no
cor(df_key$pred2, df_key$vote)
#+end_src

#+RESULTS:
: [1] 0.9739703

Contemplate this in light of another assertion by Dr. Frank in the full presentation
presenting this fraud theory (which this brief is citing):[fn:23]

#+begin_export latex
\begin{tabular}{p{0.1cm}|p{0.85\textwidth}}
& "Correlation Coefficient, R"
A statistical value that indicates how well a set of values predicts a target set of data
[...]
\textit{Correlations involving human behavior rarely have R values greater than 0.8}
\end{tabular}
#+end_export

While we're discussing the function of the key, I also want to touch on this claim (pg 7):

#+begin_export latex
\begin{tabular}{p{0.1cm}|p{0.85\textwidth}}
 & We call the polynomial a "key" because it works in every county in Michigan... 
\end{tabular}
#+end_export

But /does/ it work in every county in Michigan? We don't have data for votes and
registrations except for the nine counties analyzed, but we /do/ have Census age
data covering all MI counties. This allows us to look at the distribution of age as a
percent of the total population per county.

#+name: all-counties-pop
#+header: :file ./plots/all-counties-pop.pdf :width 9 :height 5
#+begin_src R :session r :exports results :results file graphics :eval no
mi_cty_all <- read_csv("data/census/mi_pop_census.csv") %>%
  select(3:7, 25, 19, 31, 34, 37, 52, 55, 58, 61, 64,
         67, 70, 73, 76, 79, 82, 85, 88, 91) %>%
  filter(YEAR==12) %>%
  mutate(AGE1819 = AGE1824_TOT-AGE2024_TOT) %>%
  select(CTYNAME, AGE1819, AGE2024_TOT:AGE85PLUS_TOT) %>%
  pivot_longer(cols=!CTYNAME) %>%
  group_by(CTYNAME) %>%
  mutate(age_i = c(18, seq(20, 80, by=5), 85)) %>%
  mutate(val_i = value/c(2, rep(5, 13), 15))

mi_cty_all %>% group_by(CTYNAME) %>%
  mutate(perc = val_i/sum(val_i),
         target = ifelse(CTYNAME %in% c("Antrim County", "Barry County",
                                        "Charlevoix County",
                                        "Grand Traverse County",
                                        "Kent County",
                                        "Livingston County",
                                        "Macomb County",
                                        "Oakland County",
                                        "Wayne County"), "Y", "N"),
         target = recode(target, N="Others", Y="Nine counties analyzed")) %>%
  ggplot(aes(x=age_i, y = perc, group = CTYNAME)) + geom_line(size=0.7, alpha=0.5) +
  facet_wrap(~target) +
  scale_x_continuous("age") + theme_bw() + scale_y_continuous("fraction of population")
#+end_src

#+attr_latex: :width 0.85\textwidth
#+RESULTS: all-counties-pop
[[file:./plots/all-counties-pop.pdf]]

The nine counties look rather "average" compared to some of the extremes present in
others. Ultimately, the polynomial is simply modeling turnout, and as long as this is
rather consistent by age across the counties, changes in age
demographics within a county are irrelavent. More population of a certain age yields more registrations at
that age, which is multiplied by the polynomial model for turnout, and yields more votes
for that age. That said, factors affecting turnout among an age group (e.g. a college campaign
encouraging students to vote, or increasing voting accessibility for a certain age group)
/would/ deviate from the state mean turnout by age, which is what this polynomial is
fitting. Thus, these more extreme counties /may/ still break the mold.

#+begin_src R :session r :exports none :results wrap :eval no
mi_cty_all %>% group_by(CTYNAME) %>%
  mutate(perc = val_i/sum(val_i)) %>%
  filter(age_i < 30) %>%
  summarize(perc = round(sum(perc), 3)) %>%
  ungroup() %>%
  arrange(desc(perc)) %>% head()
#+end_src

#+begin_src R :session r :exports none :results wrap :eval no
mi_cty_all %>% group_by(CTYNAME) %>%
  mutate(perc = val_i/sum(val_i)) %>%
  filter(age_i > 64) %>%
  summarize(perc = round(sum(perc), 3)) %>%
  ungroup() %>%
  arrange(desc(perc)) %>% head()
#+end_src

#+attr_latex: :align ll|ll
| *Population < 30* |       | *Populaion > 65*    |       |
|-------------------+-------+---------------------+-------|
| Isabella County   | 0.481 | Keweenaw County     |  0.42 |
| Houghton County   | 0.415 | Ontonagon County    | 0.404 |
| Ingham County     | 0.401 | Alcona County       | 0.389 |
| Washtenaw County  | 0.388 | Roscommon County    | 0.367 |
| Mecosta County    | 0.373 | Montmorency County  | 0.359 |
| Kalamazoo County  | 0.338 | Presque Isle County | 0.354 |


** Correlation does not equal @@latex:\xcancel{causation}@@ accuracy

We all know that "correlation does not equal causation,"
but did you know that correlation, as in Pearson's Correlation Coefficient (R-value), does
not equal /accuracy/?[fn:26] Here are some of the claims on accuracy in the brief:
- "The ability to predict ballot demographics with such remarkable precision (average
  correlation coefficient of R=0.997)..." (pg. 5)
- "...we can predict the number of ballots cast in a county to 99.7% certainty without
  seeing the results." (pg. 6)
- "Every other county may think they are clean. They are not. Indeed, the key works in
  Barry County with 99.6% certainty." (pg 12)

A brief comment: the second item is patently false. We were told above, "...we simply
graph the ratio between the black and the red, which creates the polynomial." With
registered voters /and/ votes (i.e "results") in hand, they found a polynomial such
that ~votes/registered = poly~ and then proceeded to show us that, indeed, ~registered *
poly = votes~. 

The correlation coefficient is more like asking "do these variables move
together in the same patterns?" This may seem like a nuance (doesn't moving together imply
that one predicts the other?), but I will demonstrate that R-value does not imply accuracy
with respect to error. Using extracted Antrim County data I computed an R-value
of 0.990 (vs. 0.993 by Dr. Frank). This was sufficient to validate the data as reasonable
in light of it being extracted from a screenshot. Ages were filtered to \(\leq\)90 because 
extraction was suboptimal on the tails where curves overlapped, and error would be
proportionally larger for such small values.

#+begin_src R :session r :exports both :results output wrap :eval no
df_pred <- df %>%
  filter(CTYNAME=="Antrim County", var %in% c("reg", "vote", "pred")) %>%
  pivot_wider(id_cols=c(CTYNAME, age_i), names_from=var, values_from=val_i) %>%
  filter(age_i < 91)

cor(df_pred$pred, df_pred$vote)
#+end_src

#+RESULTS:
:results:
[1] 0.9901213
:end:

Above, using population as a predictor resulted in a smoother curve that was still
correlative (R=0.97), but the resulting prediction was still quite in line with actual
votes. What if we used a different key? Here, I apply a uniform sequence from 4 through 8
(same length as the data):

#+begin_src R :session r :exports code :results output wrap :eval no
df_pred <- df_pred %>%
  mutate(pred2 = reg * seq(4, 8, length=length(reg)))
#+end_src

Plotting this new prediction along with Dr. Franks data yields the following result:

#+name: pred-compare
#+header: :file ./plots/antrim-pred-compare.pdf :width 9 :height 5
#+begin_src R :session r :exports results :results file graphics :eval no
df_pred %>% pivot_longer(cols=c(reg, pred, pred2, vote)) %>%
  ggplot(aes(x=age_i, y=value, color=name)) + geom_line(size=1) +
  facet_wrap(~CTYNAME) +
  scale_x_continuous("age") + scale_y_continuous("population") +
  scale_color_discrete(breaks=c("reg", "vote", "pred", "pred2"),
                       labels=c("registered", "votes", "Dr. Frank", "my key")) +
  theme_bw()

#+end_src

#+attr_latex: :width 0.75\textwidth
#+RESULTS: pred-compare
[[file:./plots/antrim-pred-compare.pdf]]

Could this prediction be described as "accurate" or "precise"? Yet what do we find?

#+begin_src R :session r :exports both :results output wrap :eval no
cor(df_pred$pred2, df_pred$vote)
#+end_src

#+RESULTS:
:results:
[1] 0.9930492
:end:

How... is this possible? The correlation coefficient is useful for, well, correlating, and
the data /do/ correlate: "The red line is almost a direct image of the black line, but
just lower on the graph." (pg 11) My result is just higher on the graph. This toy example
illustrates that correlation does not mean accurate. We can verify this further via a
residual plot of ~error = (prediction-actual)~:[fn:10] 

#+name: resid
#+header: :file ./plots/antrim-resid.pdf :width 9 :height 5
#+begin_src R :session r :exports results :results file graphics :eval no
df_pred %>%
  mutate(error = pred-vote) %>%
ggplot(aes(x=age_i, y=error)) + geom_point() + 
  scale_x_continuous("age") +
  scale_y_continuous("error, prediction-votes") +
  theme_bw()
#+end_src

#+attr_latex: :width 0.75\textwidth
#+RESULTS: resid
[[file:./plots/antrim-resid.pdf]]

We're seeing errors of +30 to -20 across the range of ages, and if you didn't take note in
earlier plots, Antrim County is /tiny/. Here's the prediction error as a percent of the
voters at each age, highlighting that "99.3% correlation" can still manage -15 to 25%
error.

#+begin_src R :session r :exports none :results silent :eval no
df_pred %>%
  mutate(error = vote-pred,
         perc = (pred-vote)/vote) %>%
  summarise(
    rmse_err = sqrt(sum(error**2)/length(error)),
    rmse_perc = sqrt(sum(perc**2)/length(perc)))
#+end_src

#+name: resid-perc
#+header: :file ./plots/antrim-resid-perc.pdf :width 9 :height 5
#+begin_src R :session r :exports results :results file graphics :eval no
df_pred %>%
  mutate(perc = (pred-vote)/vote) %>%
ggplot(aes(x=age_i, y=perc)) + geom_point() + 
  scale_x_continuous("age") +
  scale_y_continuous("error, (prediction-votes)/votes") +
  theme_bw()
#+end_src

#+attr_latex: :width 0.75\textwidth
#+RESULTS: resid-perc
[[file:./plots/antrim-resid-perc.pdf]]

The residuals indicate a bias in the prediction. They should center about the line
~error=0~, be randomly distributed, and have no obvious trend across the independent variable,
=age=. We have a downward trend in this case, which I'll point out is in the opposite
direction of what this theory proposes. The key is creating a prediction that's /too high/ given
the actual result for younger ages (+error) and /too low/ for older ages (-error).

Root Mean Squared Error is a better assessment of accuracy, and is as follows for all 9
counties, computed using Dr. Frank's prediction (light blue) and reported votes (red) in
the plots:

#+begin_src R :session r :exports results :results wrap :eval no
df %>%
  filter(age_i < 91) %>%
  pivot_wider(id_cols=c(CTYNAME, age_i),
              names_from=var, values_from=val_i) %>%
  group_by(CTYNAME) %>%
  mutate(error = pred-vote,
         perc=(pred-vote)/vote) %>%
  summarise(rmse = round(sqrt(sum(error**2)/length(error)), 1),
            rmse_perc = round(sqrt(sum(perc**2)/length(perc)), 3))
#+end_src

#+RESULTS:
:results:
| *County*              | *RMSE, absolute* | *RMSE, percent* |
|-----------------------+------------------+-----------------|
| Antrim County         |             16.3 |           0.115 |
| Barry County          |             22.9 |           0.068 |
| Charlevoix County     |             14.9 |           0.093 |
| Grand Traverse County |             37.2 |           0.062 |
| Kent County           |            135.6 |            0.04 |
| Livingston County     |             59.6 |           0.052 |
| Macomb County         |            145.7 |            0.03 |
| Oakland County        |            320.2 |           0.042 |
| Wayne County          |            367.7 |           0.039 |
:end:

\newpage

** The student becomes the teacher

With this hypothesis in mind, can we recreate this effect out of whole cloth? I think this
illusion is so effective because of the granularity of the per-age data. Because we've
likely never studied age demographics in detail, seeing the shape of these curves mirror
each other is hard to write off as "just how it's supposed to be." Humans are
pattern-seekers, and seeing these patterns plotted and graphed for the first time
jolts the brain's recognition software.

The primary tactic used by fraud theories is what I call "argument by inception:" namely,
this "phenomonen" never existed in your mind before you were told to think of it. When
have you /ever/ paid attention to age demographic data before you were told that voter
registrations matching the shape of votes collected is "weird"? When have you /ever/
wondered about the number of unique last names in Pennsylvania until someone checked?[fn:27]

Here is another statistic you have never checked: the united states algorithmically controls the
issuance of drivers' licenses across age groups according to the proportion of female
smokers.[fn:28][fn:29] I used data from 2009 on smokers by age, and data from 2010 on
drivers by age to discover that a 6th degree polynomial is being used to regulate the 
issuance of licenses in the United States with 99.3% \xcancel{correlation} absolute
precision.  

#+begin_src R :session r :exports none :results silent
us_pop_2010 <- read_csv("data/census/us_pop_groups.csv", skip=10, n_max=20,
         col_names=c("group", "all_n", "all_p", "male", "m_p", "female", "f_p")) %>%
  select(group, male, female)  %>%
  filter(!is.na(group)) %>%
  pivot_longer(cols=c(male, female)) %>%
  filter(name=="female") %>%
  mutate(group = recode(group,
         `.20 to 24 years` = "a2024", `.25 to 29 years` = "a2529",
         `.30 to 34 years` = "a3034", `.35 to 39 years` = "a3539",
         `.40 to 44 years` = "a4044", `.45 to 49 years` = "a4549",
         `.50 to 54 years` = "a5054", `.55 to 59 years` = "a5559",
         `.60 to 64 years` = "a6064", `.65 to 69 years` = "a6569",
         `.70 to 74 years` = "a7074", `.18 to 20 years` = "a1820",
         `.21 to 44 years` = "a2144")) %>% 
  pivot_wider(id_cols=name, values_from=value, names_from=group) %>% 
  mutate(a1819 = sum(a1820, a2144) -
           sum(a2024, a2529, a3034, a3539, a4044),
         a1824 = a1819 + a2024) %>%
  select(name, a1824, a2529:a7074) %>%
  rename(sex=name) %>%
  pivot_longer(cols=!sex)


smk <- read_csv("data/misc/gallup_smoking_males_2009.csv",
         col_names=c("age", "perc")) %>%
  add_column(sex="male") %>%
  add_row(read_csv("data/misc/gallup_smoking_females_2009.csv",
                   col_names=c("age", "perc")) %>%
          add_column(sex="female")) %>%
  filter(sex == "female") %>%
  group_by(sex) %>%
  summarise(age_i = approx(age, perc, 18:74)$x,
            perc_i = approx(age, perc, 18:74)$y) %>%
  mutate(age_grp = cut(age_i, include.lowest=T,
                       breaks=c(18, seq(24, 74, by=5)),
                       labels=c("a1824", "a2529", "a3034", "a3539", "a4044",
                                "a4549", "a5054", "a5559", "a6064", "a6569",
                                "a7074"))) %>%
  group_by(sex, age_grp) %>%
  summarise(smk = mean(perc_i)) %>%
  ungroup() %>%
  merge(us_pop_2010, by.x=c("sex", "age_grp"), by.y=c("sex", "name")) %>%
  mutate(smk_n = smk*value*1000) %>%
  group_by(age_grp) %>%
  summarise(smk = sum(smk_n)) %>%
  ungroup()

drv <- read_excel("data/misc/drivers-by-age_2010.xls", range="A14:J32", col_names=F) %>%
  select(1, 8) %>% rename(age = "...1", drv = "...8") %>%
  pivot_wider(names_from=age, values_from=drv) %>%
  mutate(`a1824` = `18` + `19` + `(20-24)`) %>%
  select(`a1824`, `25-29`:`70-74`) %>%
  pivot_longer(cols=`a1824`:`70-74`) %>%
  mutate(age_grp = recode(name,
                          `25-29` = "a2529", `30-34` = "a3034", `35-39` = "a3539",
                          `40-44` = "a4044", `45-49` = "a4549", `50-54` = "a5054",
                          `55-59` = "a5559", `60-64` = "a6064", `65-69` = "a6569",
                          `70-74` = "a7074")) %>%
  rename(drv = "value")
#+end_src

After reading in the raw data (smoking data extracted from the plot using
WebPlotDigitizer), I aligned age groups, merged the data, and applied a 6th degree
polynomial model to find the following correlation value:

#+begin_src R :session r :exports both :results output :eval no
smk_drv <- smk %>% select(age_grp, smk) %>%
  merge(drv %>% select(age_grp, drv),
        by="age_grp")

fit <- lm(drv ~ poly(smk, 6), data=smk_drv)
smk_drv <- smk_drv %>%
  mutate(pred = predict(fit, smk_drv))

cor(smk_drv$pred, smk_drv$drv)
#+end_src

#+RESULTS:
: [1] 0.9926732

#+begin_src R :session r :exports none :results output :eval no
smk_drv %>%
  mutate(error = (pred-drv)/drv) %>%
  summarise(rmse_perc = sqrt(sum(error**2)/length(error))
#+end_src

#+RESULTS:
:    rmse_perc
: 1 0.02659507

How does our prediction look (root mean squared error = 2.7%, btw)?

#+name: smk-drv-pred
#+header: :file ./plots/smk-drv-pred.pdf :width 9 :height 5
#+begin_src R :session r :exports results :results file graphics :eval no
smk_drv %>%
  mutate(x = 1:length(age_grp)) %>%
  pivot_longer(cols = !c(age_grp, x)) %>%
  ggplot(aes(x=x, y=value, group=name, color=name, size=name)) + geom_line(size=1) +
  scale_x_continuous("age group",
                     breaks=1:11,
                     labels=smk_drv %>% pull(age_grp)) +
  scale_color_discrete("", breaks=c("smk", "drv", "pred"),
                       labels=c("smokers", "drivers", "predicted drivers")) +
  scale_y_continuous("population") +
  theme_bw() 
#+end_src

#+attr_latex: :width \textwidth
#+RESULTS: smk-drv-pred
[[file:./plots/smk-drv-pred.pdf]]


\newpage

